testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_100000000____delay-ms_1____loss-rate-percent_0.0001____clients-requests_10/1/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 3.95s, 2.53 req/s, 241.31MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305930) total, 130B (130) headers (space savings 86.46%), 953.67MB (1000000000) data
UDP datagram: 69932 sent, 821395 received
                     min         max         mean         sd        +/- sd
time for request:      3.92s       3.94s       3.93s      6.27ms    60.00%
time for connect:     6.11ms     27.76ms     16.73ms      7.28ms    60.00%
time to 1st byte:    27.35ms     30.44ms     28.87ms      1.06ms    60.00%
req/s           :       0.25        0.25        0.25        0.00    70.00%